[GENERAL]
NAME					= Suomi (Finnish)
TRANSLATOR				= Teemu Paavola - teemu.paavola@outlook.com
DLG_FONT_NAME				= 
DLG_FONT_SIZE				= 


[TEXT]
TEXT_MESSAGEBOX_OK			= OK
TEXT_MESSAGEBOX_CANCEL			= Peruuta
TEXT_MESSAGEBOX_ABORT			= Keskeytä
TEXT_MESSAGEBOX_RETRY			= Yritä uudelleen
TEXT_MESSAGEBOX_IGNORE			= Hylkää
TEXT_MESSAGEBOX_YES			= Kyllä
TEXT_MESSAGEBOX_NO			= Ei
TEXT_MESSAGEBOX_CONTINUE		= Jatka

TEXT_APP_NAME				= Honeyview
TEXT_BETA				= Beta
TEXT_PORTABLE				= Portable
TEXT_BUILDNO				= Versio#
TEXT_SELECT_FOLDER			= Valitse kansio.
TEXT_ASSOC_IMAGE			= Kuvatiedosto (${str1})
TEXT_ASSOC_RAWIMAGE			= Raakakuvavedos (${str1})
TEXT_ASSOC_EBOOK			= Pakattu kuvatiedosto (${str1})
TEXT_APP_DESC				= Honeyview on huippunopea kuvankatseluohjelma.
TEXT_ABOUTBOX_TAB1			= Tietoa Honeyviewistä
TEXT_PHOTOFOLDER_NAME			= Honeyview
TEXT_OPENFILEDLG_IMAGEFILE		= Kuvatiedosto
TEXT_OPENFILEDLG_ALLFILE		= Kaikki tiedostot
TEXT_NEW_FOLDER				= Uusi kansio
TEXT_TRANSF_FILE_BEGIN_WITH		= Honeyview_

TEXT_UPDATE_DOWNLOAD_ERROR_MSG		= Vaadittuja asennustietoja ei onnistuttu lataamaan.
TEXT_UPDATE_VERSION_CHECK_FAILED	= Version tarkistus epäonnistui
TEXT_UPDATE_VERSION_CHECKING		= Version tarkistus
TEXT_UPDATE_DOWNLOAD_FAILED		= Lataus epäonnistui
TEXT_UPDATE_LATEST_VERSION		= Ajantasalla
TEXT_UPDATE_DO_DOWNLOAD			= Päivitys tarvitaan
TEXT_UPDATE_DOWNLOAD_COMPLETED		= Lataus valmis

TEXT_MSG_LASTPAGE			= Tämä on viimeinen kuva.
TEXT_MSG_FIRSTPAGE			= Tämä on ensimmäinen kuva.
TEXT_MSG_NOIMAGEFILE			= Pakatussa tiedostossa ei ole kuvia.
TEXT_MSG_INVALID_PHOTOFOLDER		= Aseta kuvakansion polku asetuksissa.
TEXT_MSG_CANTOPENARCHIVE		= Tiedoston avaaminen epäonnistui:
TEXT_MSG_INVALID_ARCHIVE_VERSION	= Tämä tiedosto ei ole tuettu. Lataisitko uusimman version.
TEXT_MSG_INVALID_PASSWORD		= Väärä salasana.
TEXT_MSG_STRETCHWHENSMALL_ON		= Venytä pieniä kuvia: Päällä
TEXT_MSG_STRETCHWHENSMALL_OFF		= Venytä pieniä kuvia: Pois
TEXT_MSG_CANTOPENBOOKMARK		= Kirjanmerkkien avaaminen epäonnistui.
TEXT_MSG_BROKENARCHIVE			= Tämä pakattu tiedosto on viottunut.
TEXT_MSG_ADDTOBOOKMARK			= Lisää kirjanmerkkeihin: 
TEXT_MSG_LOADRECENTBOOKMARK		= Avaa viimeisin tallennettu kirjanmerkki:
TEXT_MSG_SLIDESHOWSTART			= Avaa diaesitys: ${TIME}sek
TEXT_MSG_SLIDESHOWSTOP			= Pysäytä diaesitys
TEXT_MSG_ALWAYSONTOP_ON			= Aina päällimäisenä: Päällä
TEXT_MSG_ALWAYSONTOP_OFF		= Aina päällimäisenä: Pois
TEXT_MSG_ZOOMFIX_ON			= Korjaa zoomaa sisään/ulos: Päällä
TEXT_MSG_ZOOMFIX_OFF			= Korjaa zoomaa sisään/ulos: Pois
TEXT_MSG_EXTPROGERR_LAUNCH		= Avaa kuvankäsittelyohjelmalla
TEXT_MSG_EXTPROGERR_NOTSET		= Aseta kuvankäsittelyohjelma (Paint, Photoshop, jne.). 
TEXT_MSG_ARCHIVEBOOKMARK		= Muista sijainti pakatun tiedoston sisällä:
TEXT_MSG_RESTART_NOTIFY			= Sovellus käynnistyy uudelleen.
TEXT_MSG_COPY2CLIPBOARD			= Kopioitu leikepöydälle.
TEXT_MSG_COPY2CLIPBOARD_FAILED		= Leikepöydälle kopiointi epäonnistui.
TEXT_MSG_BOOKMARK_EXPORTED		= Kirjanmerkki tallennettu.
TEXT_MSG_BOOKMARK_EXPORT_FAILED		= Kirjanmerkkeihin tallentaminen epäonnistui
TEXT_MSG_BOOKMARK_OPEN_FAILED		= Kirjanmerkkien avaaminen epäonnistui
TEXT_MSG_BOOKMARK_IMPORT_FAILED		= Kirjanmerkkien tuonti epäonnistui
TEXT_MSG_BOOKMARK_IMPORTED		= Kirjanmerkit tuotu
TEXT_MSG_SETWALLPAPER_FAILED		= Työpöydän taustakuvan vaihtaminen epäonnistui.
TEXT_MSG_CANT_OPEN_IMAGE		= Kuvatiedoston avaaminen epäonnistui.
TEXT_MSG_TRANSFORM_COMPLETED		= Työstö valmis.
TEXT_MSG_TRANSFORM_ERR_CANT_OPEN_FILE	= Tiedoston avaaminen epäonnistui.
TEXT_MSG_TRANSFORM_ERR_CANT_SAVE_FILE	= Tiedoston tallentaminen epäonnistui.
TEXT_MSG_CANT_OPEN_MMF			= MMF:n avaaminen epäonnistui. (mmf:${str1})
TEXT_MSG_NOTICE_RESTART			= Ohjelma käynnistyy uudelleen.
TEXT_MSG_DELETED			= Poistettu

TEXT_ASK_INIT				= Haluatko palauttaa oletusasetukset?
TEXT_ASK_DELETE_IMAGE			= Oletko varma, että haluat siirtää tiedoston roskakoriin?
TEXT_ASK_DELETE_ARCHIVE			= Nykyinen kuva on osa pakattua tiedostoa.[br][br] Haluatko poistaa pakatun tiedoston (${FILENAME})?
TEXT_ASK_DELETE_BOOKMARKALL		= Haluatko poistaa kaikki tallennetut kirjanmerkit?
TEXT_ASK_LAUNCH_ASSOCUI			= Windows 8:n tai myöhemmissä versioissa, käyttäjien pitää asettaa ohjelma oletukseksi manuaalisesti. [br][br]Haluatko asettaa sovelluksen oletukseksi?
TEXT_ASK_STOP_BATCH_PROCESSING		= Processing is under progress. Do you want to cancel it?

TEXT_FILTERMODE_NONE			= Ei suodinta
TEXT_FILTERMODE_BILINEAR		= Suodin: Pehmennetty
TEXT_FILTERMODE_SHARPEN			= Suodin: Pehmennetty+Terävöitetty

TEXT_SHOWMODE_NONE			= Näytä: Alkuperäinen koko (100%)
TEXT_SHOWMODE_FIT2WINDOW		= Näytä: Sovita ikkunaan
TEXT_SHOWMODE_FIT2WIDTH			= Näytä: Sovita leveyteen
TEXT_SHOWMODE_TWO_L2R			= Älykäs tuplasivu (Vasen->Oikea)
TEXT_SHOWMODE_TWO_R2L			= Älykäs tuplasivu (Oikea<-Vasen)

TEXT_NEXTPATH_NOFILE			= Siirrä kansio: Siirtyminen mahdotonta (Avaa tiedosto)
TEXT_NEXTPATH_LASTFOLDER		= Seuraava kansio: Siirtyminen mahdotonta
TEXT_PREVPATH_LASTFOLDER		= Edellinen kansio: Siirtyminen mahdotonta
TEXT_NEXTPATH_OPENFOLDER		= Seuraava kansio:
TEXT_PREVPATH_OPENFOLDER		= Edellinen kansio:

TEXT_DELETE				= Poista: 	
TEXT_COPY_TO_PHOTOFOLDER1		= Kopioi kuvakansioon 1:
TEXT_COPY_TO_PHOTOFOLDER2		= Kopioi kuvakansioon 2:
TEXT_MOVE_TO_PHOTOFOLDER1		= Siirrä kuvakansioon 1:

TEXT_SELECTFILEDLG_FILELIST		= Luettelo
TEXT_SELECTFILEDLG_DATE			= Muokkauspäivämäärä
TEXT_SELECTFILEDLG_SIZE			= Koko

TEXT_BOOKMARKEDITDLG_PATH		= Polku

TEXT_PAGETURNFX_NONE			= Ei tehostetta
TEXT_PAGETURNFX_HV2			= Pyöräytä
TEXT_PAGETURNFX_ALPHA			= Häivytä
TEXT_PAGETURNFX_SLIDE			= Liu'uta

TEXT_FILEINFO_FILENAME			= Tiedostonimi
TEXT_FILEINFO_SIZE			= Kuvan koko
TEXT_FILEINFO_CREATETIME		= Luontipäivämäärä
TEXT_FILEINFO_MODIFYTIME		= Muokkauspäivämäärä
TEXT_FILEINFO_IMGINFO			= Kuvan tiedot
TEXT_FILEINFO_ROTATE			= Kiertoasetukset
TEXT_FILEINFO_ZOOM			= Zoomaa Sisään/Ulos

TEXT_EXIF_MAKER				= Tee
TEXT_EXIF_MODEL				= Kameramalli
TEXT_EXIF_SOFTWARE			= Softa
TEXT_EXIF_ARTIST			= Kuvataiteilija
TEXT_EXIF_COPYRIGHTPHOTOGRAPHER		= Kopiosuojaus
TEXT_EXIF_DATETIME			= Kuvauspäivämäärä ja -aika
TEXT_EXIF_FLASHUSED			= Salama
TEXT_EXIF_FOCALLENGTH			= Polttoväli
TEXT_EXIF_FOCALLENGTH_35MM		= 35mm Ekvivalentti
TEXT_EXIF_EXPOSURETIME			= Valotusaika
TEXT_EXIF_EXPOSUREBIAS			= Valotuksen korjaus
TEXT_EXIF_APERTUREFNUMBER		= Aukkonumero
TEXT_EXIF_ISOEQUIVALENT			= ISO-nopeus
TEXT_EXIF_METERINGMODE			= Mittatila
TEXT_EXIF_EXPOSUREPROGRAM		= Valotusohjelma
TEXT_EXIF_DISTANCE			= Polttopisteen etäisyys
TEXT_EXIF_GPS				= GPS-tiedot
TEXT_EXIF_COMMENT			= Kommentit

TEXT_CUSTOMCMD_NOOPERATION		= Älä tee mitään
TEXT_CUSTOMCMD_FULLSCREEN		= Koko näyttö
TEXT_CUSTOMCMD_MAXIMIZE			= Maksimoi
TEXT_CUSTOMCMD_MINIMIZE			= Minimoi
TEXT_CUSTOMCMD_PAGESELECT		= Valitse kuva
TEXT_CUSTOMCMD_EXIT			= Lopeta
TEXT_CUSTOMCMD_OPEN			= Avaa tiedosto
TEXT_CUSTOMCMD_OPENFOLDER		= Avaa kansio
TEXT_CUSTOMCMD_NEXT1			= Seuraava 1 Sivu (Kaksoisnäkymä) 
TEXT_CUSTOMCMD_PREV1			= Edellinen 1 Sivu (Kaksoisnäkymä)
TEXT_CUSTOMCMD_NEXT			= Seuraava kuva
TEXT_CUSTOMCMD_PREV			= Edellinen kuva
TEXT_CUSTOMCMD_NEXT_RANDOM		= Seuraava satunnainen kuva
TEXT_CUSTOMCMD_PREV_RANDOM		= Edellinen satunnainen kuva
TEXT_CUSTOMCMD_HOME			= Ensimmäinen kuva
TEXT_CUSTOMCMD_END			= Viimeinen kuva
TEXT_CUSTOMCMD_NEXT10			= Kymmenenneksi seuraava kuva
TEXT_CUSTOMCMD_PREV10			= Kymmenenneksi edellinen kuva
TEXT_CUSTOMCMD_SCROLL_UP		= Vieritä ylös
TEXT_CUSTOMCMD_SCROLL_DN		= Vieritä alas
TEXT_CUSTOMCMD_SCROLL_LEFT		= Vieritä vasemmalle
TEXT_CUSTOMCMD_SCROLL_RIGHT		= Vieritä oikealle
TEXT_CUSTOMCMD_ZOOM_IN			= Zoomaa sisään
TEXT_CUSTOMCMD_ZOOM_OUT			= Zoomaa ulos
TEXT_CUSTOMCMD_COPY2PHOTOFOLDER		= Kopioi kuvakansioon
TEXT_CUSTOMCMD_MOVE2PHOTOFOLDER		= Siirrä kuvakansioon
TEXT_CUSTOMCMD_COPY2PHOTOFOLDER2	= Kopioi kuvakansio 2:n
TEXT_CUSTOMCMD_NEXTPATH			= Seuraava pakattu tiedosto/kansio
TEXT_CUSTOMCMD_PREVPATH			= Edellinen pakattu tiedosto/kansio
TEXT_CUSTOMCMD_CONTEXT_MENU		= Kontekstivalikko
TEXT_CUSTOMCMD_EXIFSHOW_TOGGLE		= Näytä tiedoston tiedot/EXIF-tiedot

TEXT_COMBO_GIF_TRANS_OPTION_0		= Käytä alkuperäistä GIF-palettia
TEXT_COMBO_GIF_TRANS_OPTION_1		= Käytä valkoista taustaväriä
TEXT_COMBO_GIF_TRANS_OPTION_2		= Käytä ruututaustaa
TEXT_COMBO_GIF_TRANS_OPTION_3		= Käytä mustaa taustaväriä

TEXT_COMBO_LASTFILE_ACTION_NONE		= Älä tee mitään
TEXT_COMBO_LASTFILE_ACTION_ASK		= Kysy
TEXT_COMBO_LASTFILE_ACTION_LOOP		= Siirry ensimmäiseen tiedostoon
TEXT_COMBO_LASTFILE_ACTION_NEXTPATH	= Siirry seuraavaan/edelliseen kansioon/tiedostoon

TEXT_ASSOC_GROUP0			= Usein käytetyt kuvaformaatit
TEXT_ASSOC_GROUP1			= Uusimmat käyttöönotetut kuvaformaatit
TEXT_ASSOC_GROUP2			= Kameran häviöttömät kuvaformaatit
TEXT_ASSOC_GROUP3			= Pakatut kuvatiedostomuodot

TEXT_SORT_METHOD_FILENAME		= Lajittele nimen mukaan
TEXT_SORT_METHOD_DATE			= Lajittele muokkauspäivämäärän mukaan
TEXT_SORT_METHOD_SIZE			= Lajittele koon mukaan
TEXT_SORT_METHOD_EXT			= Lajittele tyypin mukaan

TEXT_TRANSF_RESIZE_NONE			= Älä vaihda kokoa
TEXT_TRANSF_RESIZE_KEEPRATIO		= Säilytä alkuperäinen suhde
TEXT_TRANSF_RESIZE_FITWIDTH		= Sovita leveyteen
TEXT_TRANSF_RESIZE_ADD			= Lisää täyte 
TEXT_TRANSF_RESIZE_CUT			= Rajaa kuva
TEXT_TRANSF_RESIZE_STRETCH		= Venytä kuva

TEXT_TRANSF_FORMAT_TO_SAVE_AUTO		= Automaattinen
TEXT_TRANSF_FORMAT_TO_SAVE_JPG		= JPG
TEXT_TRANSF_FORMAT_TO_SAVE_PNG		= PNG

TEXT_BTN_PREV_FOLDER			= Edellinen kansio ( [ )
TEXT_BTN_NEXT_FOLDER			= Seuraava kansio ( ] )
TEXT_BTN_PREV_ARCHIVE			= Edellinen pakattu tiedosto ( [ )
TEXT_BTN_NEXT_ARCHIVE			= Seuraava pakattu tiedosto ( ] )


[MENU]
MENUSTR_OPEN				= Avaa\tF2
MENUSTR_OPENFOLDER			= Avaa kansio\tF
MENUSTR_CLOSE				= Sulje\tF4\tF4
MENUSTR_PAGESELECT			= Valitse kuva\tEnter
MENUSTR_OPEN_FILEPOSITION		= Näytä resurssienhallinnassa\tCtrl+Enter

MENUSTR_FILTER_NONE			= Ei suodinta\tU
MENUSTR_FILTER_BILINEAR			= Pehmennä\tI
MENUSTR_FILTER_SHARPEN			= Pehmennä+Terävöitä\tS

MENUSTR_PAGEMOVE			= Siirtyminen
MENUSTR_PAGEMOVE_NEXT			= Seuraava kuva\t->
MENUSTR_PAGEMOVE_PREV			= Edellinen kuva\t<-
MENUSTR_PAGEMOVE_HOME			= Ensimmäinen kuva\tHome
MENUSTR_PAGEMOVE_END			= Viimeinen kuva\tEnd
MENUSTR_PAGEMOVE_NEXT10			= Seuraavaksi kymmenes kuva\tCtrl+PageDown
MENUSTR_PAGEMOVE_PREV10			= Edeltävä kymmenes kuva\tCtrl+PageUp
MENUSTR_PAGEMOVE_RAND_NEXT		= Seuraava satunnainen kuva\tCtrl+Alt+PageDown
MENUSTR_PAGEMOVE_RAND_PREV		= Edeltävistä satunnainen kuva\tCtrl+Alt+PageUp
MENUSTR_PAGEMOVE_NEXT_PATH		= Seuraava kansio/Pakattu tiedosto\t]
MENUSTR_PAGEMOVE_PREV_PATH		= Edellinen kansio/Pakattu tiedosto\t[

MENUSTR_INTERPOLATEMODE			= Interpolointi
MENUSTR_INTERPOLATEMODE_BILINEAR	= Bilineaarinen Interpolaatio (Nopea)
MENUSTR_INTERPOLATEMODE_BICUBIC		= Bikubinen Interpolaatio (Hidas, Korkea laatu)
MENUSTR_INTERPOLATEMODE_LANCZOS		= Lanczos Interpolaatio (Hidas, Korkea laatu)

MENUSTR_IMAGE_PROCESSING		= Kuvatehoste
MENUSTR_IMAGE_PROCESSING_NEGATIVE	= Käänteiset värit\tCtrl+I
MENUSTR_IMAGE_PROCESSING_GAMMA		= Gammakorvaus\tCtrl+G
MENUSTR_IMAGE_PRICESSING_FLIP		= Käännä pystysuunnassa\tCtrl+F
MENUSTR_IMAGE_PRICESSING_MIRROR		= Käännä vaakasuunnassa\tCtrl+M

MENUSTR_SORT_METHOD			= Lajittele
MENUSTR_SORT_METHOD_FILENAME		= Nimen mukaan
MENUSTR_SORT_METHOD_DATE		= Muokkauspäivämäärän mukaan
MENUSTR_SORT_METHOD_SIZE		= Koon mukaan
MENUSTR_SORT_METHOD_EXT			= Tyypin mukaan
MENUSTR_SORT_DESCENDING			= Alenevasti

MENUSTR_SHOWMODE			= Kuvan näkyvyys
MENUSTR_FILTER_STRETCHWHENSMALL		= Venytä pienet kuvat\tZ
MENUSTR_SHOWMODE_NONE			= Alkuperäinen koko (100%)\t0
MENUSTR_SHOWMODE_STRETCH		= Sovita ikkunaan\t9
MENUSTR_SHOWMODE_FITWIDTH		= Sovita leveyteen\t8
MENUSTR_SHOWMODE_TWO_L2R		= Älykäs tuplasivu (Vasen->Oikea)\t7
MENUSTR_SHOWMODE_TWO_R2L		= Älykäs tuplasivu (Oikea<-Vasen)\t6

MENUSTR_ZOOM				= Zoomaa
MENUSTR_ZOOM_IN				= Zoomaa sisään\t+
MENUSTR_ZOOM_OUT			= Zoomaa ulos\t-
MENUSTR_ZOOM_FIX			= Korjaa\tCtrl+K
MENUSTR_ZOOM_100			= 100%\t*
MENUSTR_ZOOM_IN_1			= Zoomaa sisään(1%)\tCtrl++
MENUSTR_ZOOM_OUT_1			= Zoomaa ulos(1%)\tCtrl+-

MENUSTR_ROTATION			= Kieritä
MENUSTR_ROTATION_NONE			= Älä kieritä\tAlt+Up
MENUSTR_ROTATION_L90			= Kierrä 90˚ vastapäivään\tAlt+Left
MENUSTR_ROTATION_R90			= Kierrä 90˚ myötäpäivään\tAlt+Right
MENUSTR_ROTATION_180			= Pyöräytä vaakasuunnassa\tAlt+Down

MENUSTR_EXIFSHOW_TOGGLE			= Tiedosto-/EXIF-tiedot\tTAB
MENUSTR_WALLPAPER			= Aseta taustakuvaksi
MENUSTR_DELETE				= Poista\tDel
MENUSTR_COPY_TO_PHOTOFOLDER		= Kopioi kuvakansioon\tIns
MENUSTR_EXTPROG0			= Avaa kuvankäsittelyohjelmalla\tCtrl+E
MENUSTR_PRINT				= Tulosta\tCtrl+P
MENUSTR_COPY2CLIPBOARD			= Kopioi leikepöydälle\tCtrl+C

MENUSTR_SETTING				= Muokkaus\tF5
MENUSTR_ABOUT				= Tietoa Honeyviewistä\tF1
MENUSTR_EXIT				= Lopeta\tX

; about popup menu
MENUSTR_HOMEPAGE			= Kotisivu
MENUSTR_HELP				= Pikanäppäinapu

; bookmark popup menu
MENUSTR_BOOKMARK_ADD			= Lisää kirjanmerkkeihin\tB
MENUSTR_BOOKMARK_DELALL			= Poista kaikki kirjanmerkit
MENUSTR_BOOKMARK_SETTTING		= Kirjanmerkkiasetukset
MENUSTR_BOOKMARK_EDIT			= Muokkaa kirjanmerkkejä\tF3

; slideshow popup menu
MENUSTR_SLIDESHOW_00			= Pysäytä diaesitys\tCtrl+0
MENUSTR_SLIDESHOW_01			= 1 sekunti\tCtrl+1
MENUSTR_SLIDESHOW_02			= 2 sekuntia\tCtrl+2
MENUSTR_SLIDESHOW_03			= 3 sekuntia\tCtrl+3
MENUSTR_SLIDESHOW_04			= 4 sekuntia\tCtrl+4
MENUSTR_SLIDESHOW_05			= 5 sekuntia\tCtrl+5
MENUSTR_SLIDESHOW_06			= 6 sekuntia\tCtrl+6
MENUSTR_SLIDESHOW_07			= 7 sekuntia\tCtrl+7
MENUSTR_SLIDESHOW_08			= 8 sekuntia\tCtrl+8
MENUSTR_SLIDESHOW_09			= 9 sekuntia\tCtrl+9
MENUSTR_SLIDESHOW_10			= 10 sekuntia
MENUSTR_SLIDESHOW_15			= 15 sekuntia
MENUSTR_SLIDESHOW_20			= 20 sekuntia
MENUSTR_SLIDESHOW_25			= 25 sekuntia
MENUSTR_SLIDESHOW_30			= 30 sekuntia
MENUSTR_SLIDESHOW_60			= 60 sekuntia
MENUSTR_SLIDESHOW_90			= 90 sekuntia
MENUSTR_SLIDESHOW_LOOP			= Toista uudelleen
MENUSTR_SLIDESHOW_RANDOM		= Satunnainen

MENUSTR_PAGETURNFX_NONE			= Ei tehostetta
MENUSTR_PAGETURNFX_HV2			= Käännä
MENUSTR_PAGETURNFX_ALPHA		= Häivytä
MENUSTR_PAGETURNFX_SLIDE		= Liu'uta

MENUSTR_PHOTOFOLDER_COPY1		= Kopioi kuvakansioon 1\tInsert
MENUSTR_PHOTOFOLDER_MOVE1		= Siirrä kuvakansioon 1\tCtrl+Insert
MENUSTR_PHOTOFOLDER_COPY2		= Kopioi kuvakansioon 2\tShift+Insert
MENUSTR_PHOTOFOLDER_SETTING		= Kuvakansion asetukset
MENUSTR_PHOTOFOLDER_OPEN		= Avaa kuvakansio 1

MENUSTR_TRANSFORMDLG			= Muokkaa kuvaa (Käännä, Muokkaa kokoa)\tCtrl+T

[DIALOG]
IDCANCEL				= Peruuta
IDOK					= OK

[IDD_ABOUT]  
IDD_ABOUT				= Tietoa Honeyviewistä
IDC_BTN_HOMEPAGE			= Kotisivu
IDC_BTN_UPDATE				= Päivitä

[IDD_SETTING]
IDD_SETTING				= Muokkaa
IDC_BTN_INIT				= Palauta

[IDD_SETTING_GENERAL]
IDC_STATIC_SETTING			= Yleiset asetukset
IDC_CHK_USESNAP				= Kiinnitä ikkuna
IDC_CHK_DONOTREMEMBERFOLDER		= Älä tallenna viimeisimmän kansion polkua
IDC_CHK_ONE_INSTANCE			= Älä anna käynnistää montaa Honeyviewiä
IDC_CHK_ASK_DELETE			= Kysy varmistus ennen tiedoston poistoa
IDC_CHK_NO_CENTER_MESSAGE		= Näytä ilmoitukset nurkassa, eikä keskellä
IDC_CHK_ALWAYS_ON_TOP			= Aina päällimäisenä (Ctrl+A)
IDC_CHK_ESC_TO_EXIT			= Poistu ESC-painikkeella
IDC_CHK_CHECK_UPDATE			= Tarkista viimeisin versio
IDC_CHK_CHECK_UPDATE_MINOR		= Tarkista aiempia versioita
IDC_STATIC_LASTFILEACTION_IMAGE		= Toiminto, kun on viimeinen/ensimmäinen kuva:
IDC_STATIC_LASTFILEACTION_ARCHIVE	= Toiminto, kun on viimeinen/ensimmäinen kuva arkistossa:

[IDD_SETTING_VIEW]
IDC_STATIC_VIEW				= Näkyvyysasetukset
IDC_CHK_SHOWBORDER			= Näytä pääikkunan reunat
IDC_CHK_SHOW_OVERLAY_FILEINFO		= Näytä tiedostonimi kun ylävalikko on piilossa (Pikanäppäin: Shift+TAB)
IDC_CHK_SAVE_ZOOM_FIX			= Tallenna kiinteä zoomaus sisään/ulos -tila
IDC_CHK_DO_NOT_SHOW_TITLE_BAR		= Älä näytä ylävalikkopalkkia
IDC_CHK_DO_NOT_SHOW_CONTROL_BAR		= Älä näytä alavalikkopalkkia
IDC_CHK_DO_NOT_SIDE_ARROW		= Älä näytä nuolinäppäimiä
IDC_CHK_DO_NOT_SHOW_ANIMINFO		= Älä näytä animaation tieto-ohjausta
IDC_CHK_DO_NOT_SHOW_ZOOMINFO		= Älä näytä zoomauksen tietojen ohjausta
IDC_CHK_HIDE_TOOLTIP_HELP		= Älä näytä näytön työkaluvinkkejä, kun hiiri menee tietueen päälle
IDC_CHK_EXIFINFO_SMALL_FONT		= Käytä pientä fonttia EXIF-/tiedoston tietoja
IDC_CHK_USEBKGNDIMAGE			= Valitse oletustaustakuva
IDC_BTN_BKGND_SET			= Selaa...
IDC_BTN_BKGND_OPEN			= Avaa kansio
IDC_STATIC_BKGNDCOLOR			= Taustaväri:
IDC_BTN_BKGND				= Valitse...
IDC_STATIC_BORDERCOLOR			= Reunaväri:
IDC_BTN_BORDERCOLOR			= Valitse...

[IDD_SETTING_BOOKMARK]
IDC_STATIC_BOOKMARK			= Kirjanmerkkiasetukset
IDC_CHK_AUTOBOOKMARK			= Tallenna nykyisen kuvan polku automaattisesti kirjanmerkkeihin
IDC_CHK_SHARE_SETTING			= Jaa kokoonpano/kirjanmerkit useiden esiintymien kesken.
IDC_CHK_REMEMBER_FILEPOS_IN_ARCHIVE	= Muista automaattisesti nykyisen kuvan polku pakatuissa kuvatiedostoissa
IDC_BTN_CLEAR_FILE_POS_IN_ARCHIVE	= Poista
IDC_STATIC_MAX_BOOKMARK			= Max. Kirjanmerkin numero:

[IDD_SETTING_ASSOC]
IDC_STATIC_ASSOC_IMAGE			= Käytettävien tiedostomuotojen lista
IDC_BTN_IMAGE_SELECT			= Valitse kaikki
IDC_BTN_IMAGE_DESELECT			= Poista kaikki valinnat
IDC_BTN_APPLY_NOW			= Hyväksy nyt

[IDD_SETTING_ASSOC_NEW]
IDC_STATIC_ASSOC_IMAGE			= Tiedostomuotojen käyttö oletuksena
IDC_STATIC_ASSOC_DESC1			= Windows 8:lla ja myöhemmillä versioilla, voit vaihtaa oletusohjelmia seuraavasti:
IDC_STATIC_ASSOC_DESC2			= 1. Klikkaa "Oletusohjelmat"-painiketta.
IDC_STATIC_ASSOC_DESC3			= 2. Valitse "Valitse kaikki" oletusohjelmien asetuksissa.
IDC_STATIC_ASSOC_DESC4			= 3. Klikkaa "Tallenna" -painiketta.
IDC_STATIC_ASSOC_DESC1_10		= Windows 10:ssä tai myöhemmissä, voit valita oletusohjelmat seuraavasti:
IDC_STATIC_ASSOC_DESC2_10		= 1. Klikkaa "Määritä oletusohjelmat" -painiketta.
IDC_STATIC_ASSOC_DESC3_10		= 2. Klikkaa "Honeyview".
IDC_STATIC_ASSOC_DESC4_10		= 3. Klikkaa sen jälkeen "Aseta tämä oletukseksi".
IDC_BTN_LAUNCH_ASSOC_REG_UI		= Kytkentäasetukset
IDC_BTN_SHOW_CLASSIC_ASSOC_UI		= Klassinen tapa

[IDD_SETTING_IMAGEPROCESSING]
IDC_STATIC_IMAGEPROCESSING		= Kuvankäsittely
IDC_CHK_EXIFROTATION			= Käännä kuvat automaattisesti EXIF-infoa vastaamaan
IDC_CHK_STRONG_SHARPEN			= Käytä voimakasta terävöintisuodinta
IDC_CHK_CACHE_IMAGE			= Siirrä seuraava kuva välimuistiin
IDC_STATIC_CACHE_MEMORY_SIZE		= Välimuistin koko: 
IDC_CHK_ALIGN_TOP_WHEN_LARGE		= Näytä yläosa kuvasta jos kuva on suurempi kuin ikkuna
IDC_CHK_USE_PREVIEW_MODE		= Näytä huonolaatuiset kuvat ensin nopeamman mallinnuksen saamiseksi
IDC_CHK_USE_IMAGE_ICC			= Käytä kuvan ICC-profiilin tietoja
IDC_CHK_USE_MONITOR_ICC			= Käytä näytön ICC-profiilin tietoja
IDC_STATIC_GIF_TRANSPARENT_OPTION	= Läpinäkyvä taustakuva GIF-kuville:
IDC_STATIC_IMAGE_TRANSPARENT_OPTION	= Läpinäkyvä taustakuva 32-bittisille kuville:
IDC_STATIC_IMAGE_INTERPOLATE_OPTION	= Interpolaatio (Koon muuttamisen suodin):
IDC_STATIC_PAGETURNFX			= Sivun vaihtamisen tehoste:

[IDD_SETTING_CUSTOM_KEY]
IDC_STATIC_CUSTOMKEYDESC_ENABLE		= Tarkista
IDC_STATIC_CUSTOMKEYDESC_KEY		= Pikanäppäin
IDC_STATIC_CUSTOMKEYDESC_ACTION		= Toiminto

[IDD_SETTING_CUSTOM_MOUSE]
IDC_STATIC_CUSTOMMOUSE_ENABLE		= Asetus
IDC_STATIC_CUSTOMMOUSE_ACTION		= Toiminto
IDC_CHK_CUSTOM_LBUTTON			= Vasen nappi
IDC_CHK_DBLCLICK2MAXIMIZE		= Suurenna/Palauta kaksoisklikkauksella
IDC_CHK_CLICK2PAGETURN			= Käännä sivua jos vasenta tai oikeaa puolta näytöstä on klikattu
IDC_CHK_CUSTOM_MBUTTON			= Keskinappi
IDC_CHK_CUSTOM_RBUTTON			= Oikea nappi
IDC_CHK_CUSTOM_XBUTTON			= X-nappula
IDC_CHK_CUSTOM_YBUTTON			= Y nappula
IDC_CHK_CUSTOM_WHEELUP			= Hiiren rulla ylös 
IDC_CHK_CUSTOM_WHEELDN			= Hiiren rulla alas

[IDD_SETTING_SHELL]
IDC_STATIC_SHELL_TITLE			= Kontekstivalikon asetukset
IDC_CHK_SHELL_USE_SHELL_MENU		= Käytä kontekstivalikkoa Resurssienhallinnassa
IDC_CHK_SHELL_TRANSFORM_DLG		= Muunna kuva Honeyviewissä
IDC_CHK_SHELL_SHOW_WITH_HONEYVIEW	= Katso kuva Honeyviewissä
IDC_CHK_SHELL_PREVIEW_IMAGE		= Esikatsele kontekstivalikossa
IDC_CHK_SHELL_SHOW_IMAGE_INFO		= Näytä kuvan tiedot
IDC_CHK_SHELL_SHOW_ICON			= Näytä Honeyviewin kuvake

[IDD_SETTING_ETC]
IDC_STATIC_SETTING_ETC			= Sekalaiset asetukset
IDC_STATIC_PHOTOFOLDER			= Kuvakansio
IDC_STATIC_PHOTOFOLDER_DESC1		= Kuvakansio 1:
IDC_STATIC_PHOTOFOLDER_DESC2		= Kuvakansio 2:
IDC_BTN_PHOTOFOLDER_SET1		= Selaa...
IDC_BTN_PHOTOFOLDER_OPEN1		= Avaa
IDC_BTN_PHOTOFOLDER_SET2		= Selaa...
IDC_BTN_PHOTOFOLDER_OPEN2		= Avaa
IDC_STATIC_EXTPROGRAM			= Kuvankäsittely
IDC_BTN_SET_EXTPROG0			= Selaa...
IDC_BTN_SET_EXTPROG1_FAST		= Esiasetus
IDC_CHK_PAGETURNWAV			= Toista ääni, kun vaihdetaan sivua
IDC_CHK_DO_NOT_LOAD_RAW_IMAGE_FILE	= Älä avaa RAW-kuvia
IDC_CHK_SKIP_RAWIMAGE_WHEN_JPG_EXIST	= Kun avataan JPEG-tiedostoja, älä avaa RAW-kuvia, joilla on sama nimi
IDC_CHK_READ_THUMBNAIL_WHEN_LOAD_RAW	= Kun avataan RAW-kuva, näytä pikkukuva jos mahdollista
IDC_CHK_RESIZE_WINDOW_2_FITIMAGE	= Säädä ikkunan koko ikkunan kokoiseksi
IDC_CHK_DISABLE_SCREEN_SAVER		= Estä Windowsin näytönsäästäjä, kun Honeyview on päällä

[IDD_SETTING_LANG]
IDC_STATIC_LANG				= Kieliasetukset
IDC_STATIC_OPEN_MULTLANG_PAGE		= [Lataa lisää kieliä...]
IDC_STATIC_OPEN_LANG_FOLDER		= [Avaa kielikansio...]

[IDD_PAGESELECT]
IDD_PAGESELECT				= Valitse kuva
IDC_CHECK_SHOW_THUMBNAIL		= Piilota pikkukuvanavigointi

[IDD_PASSINPUT]
IDD_PASSINPUT				= Anna salasana
IDC_STATIC_PASSDESC			= Tämä tiedosto on suojattu. Anna salasana.

[IDD_BOOKMARK_EDIT]
IDD_BOOKMARK_EDIT			= Muokkaa kirjanmerkkejä
IDC_BTN_DEL				= Poista
IDC_BTN_IMPORT				= Tuo kirjanmerkkejä
IDC_BTN_EXPORT				= Vie kirjanmerkkejä

[IDD_PRINT]
IDD_PRINT				= Tulosta
IDC_GROUP_PRINTER			= Valitse tulostin
IDC_BTN_PRINTER_PROPERTY		= Ominaisuudet
IDC_CHK_ROTATE				= Kieritä 90˚
IDC_CHK_FIT_IN				= Skaalaa paperille
IDC_STATIC_ZOOM				= Skaalaa:
IDC_STATIC_MARGIN_L			= Marginaali vasemmalla:
IDC_STATIC_MARGIN_T			= Yläosassa:
IDC_STATIC_MARGIN_R			= Oikealla:
IDC_STATIC_MARGIN_B			= Alaosassa:
IDC_STATIC_COPIES			= Kopioita:
IDC_BTN_PRINT				= Tulosta
IDC_BTN_CLOSE				= Sulje

[IDD_UPDATE]
IDD_UPDATE				= Honeyviewin päivitykset
IDC_STATIC_MESSAGE_1			= Honeyview-päivitykset ovat valmiita.
IDC_STATIC_MESSAGE_2			= Klikkaa Päivitä-painiketta asentaaksesi uusimman version.
IDOK					= Päivitä
IDCANCEL				= Peruuta
IDC_BTN_SETTING_UPDATE			= Asetukset

[IDD_ASK_OVERWRITE]
IDD_ASK_OVERWRITE			= Uudelleennimeä tai tallenna päälle
IDC_STATIC_ASK_OVERWRITE		= Tiedosto on jo olemassa.
IDC_STATIC_SRC				= Nykyinen kuva
IDC_STATIC_DST				= Kohdekuva
IDC_BTN_OVERWRITE			= Kirjoita päälle
IDC_BTN_RENAME				= Tallenna nimellä...

[IDD_WALLPAPER]
IDD_WALLPAPER				= Aseta työpöydän taustakuva
IDC_STATIC_PREVIEW			= Esikatsele
IDC_STATIC_BACK_COLOR			= Taustaväri
IDC_RADIO_BACKCOLOR_0			= Musta
IDC_RADIO_BACKCOLOR_1			= Automaattinen
IDC_RADIO_BACKCOLOR_2			= Muu...
IDC_BTN_BKGND				= Valitse...
IDC_BTN_CLOSE				= Sulje
IDC_BTN_APPLY				= Hyväksy nyt

[IDD_OPEN_PROGRESS]
IDD_OPEN_PROGRESS			= Avaa tiedosto
IDC_STATIC_OPENING			= Avataan...

[IDD_SELECT_FOLDER]
IDD_SELECT_FOLDER			= Valitse kansio
IDC_STATIC_FOLDER			= Kansion polku:
IDC_BTN_NEWFOLDER			= Uusi kansio
IDC_CHK_OPEN_SUBFOLDER			= Sisällytä kaikki tiedostot alikansioista

[IDD_TRANSFORM]
IDD_TRANSFORM				= Kuvien muuntaminen
IDC_STATIC_FILELIST			= Tiedostolista
IDC_STATIC_PREVIEW			= Esikatsele
IDC_BTN_START				= Aloita
IDC_BTN_CLOSE				= Sulje
IDC_BTN_OPEN_DEST_FOLDER		= Avaa kansio

[IDD_TRANSFORM_OPT]
IDC_STATIC_ROTATE			= Käännä
IDC_RADIO_ROTATE_NONE			= Älä käännä
IDC_RADIO_ROTATE_LEFT			= Käännä 90˚ vastapäivään
IDC_RADIO_ROTATE_RIGHT			= Käännä 90˚ myötäpäivään
IDC_RADIO_ROTATE_180			= Käännä 180˚
IDC_RADIO_ROTATE_AUTO			= Käännä automaattisesti vastaamaan EXIF-tietoja
IDC_STATIC_RESIZE			= Muunna kokoa
IDC_STATIC_RESIZE_SIZE			= Uusi koko

IDC_STATIC_FORMAT			= Muotoasetukset
IDC_STATIC_FORMAT_SELECT		= Muoto:
IDC_STATIC_FORMAT_QUALITY		= Laatu:
IDC_STATIC_SAVE				= Ulostulokansio
IDC_RADIO_TARGETFOLDER_SAMEFOLDER	= Tallenna alkuperäiseen kansioon
IDC_RADIO_TARGETFOLDER_PHOTOFOLDER	= Tallenna kuvakansioon
IDC_RADIO_TARGETFOLDER_CUSTOM		= Tallenna:
IDC_STATIC_FILENAME_HEADER		= Tiedoston etuliite
IDC_STATIC_FILENAME2SAVE		= Tiedostonimen esikatselu
IDC_BTN_INIT				= Palauta


[SKIN]
$TT_FULLSCREEN				= Koko näyttö (Alt+Enter)
$TT_TOGGLE_ZOOM_CONTROL			= Pikanäppäin: /
$TT_TOGGLE_ANIMINFO_CONTROL		= Pikanäppäin: Alt+Z
$TT_PAGESELECT				= Valitse kuva (Enter)
$TT_LOCKCONTROLBAR			= Lukitse ohjaimet (Pikanäppäin: ~)
$TT_LOCKTITLEBAR			= Lukitse valikko (Pikanäppäin: `)
$TT_COPY_EXIFINFO			= Kopioi kuva-/EXIF-info (Ctrl+Shift+C)
$TT_TOGGLE_EXIF				= Näytä/Piilota kuva-/EXIF-info (Pikanäppäin: Tab)
$TT_LAUNCH_GPS_LOCATION			= Näytä sijainti Google Mapsissa.(Ctrl+Shift+G)
$TT_PLAY_SOUNDNSHOT			= Toista äänitiedosto (Ääni- ja laukaustiedosto).
$TT_CLOSE_EXIFINFO			= Sulje (Pikanäppäin: Tab)
$TT_PREV_BTN				= V-hiiri:Edellinen, V-hiiri:Edeltävä kymmenes
$TT_NEXT_BTN				= O-hiiri:Seuraava, O-hiiri:Seuraavaksi kymmenes

$BTN_TEXT_EXIF				= EXIF
$BTN_TEXT_GPS				= GPS
$BTN_TEXT_PLAY_SOUNDNSHOT		= Ääni&&Laukaus
$BTN_TEXT_SHOWMODE			= Katsele
$BTN_TEXT_PHOTOFOLDER			= Kopioi
$BTN_TEXT_EDIT				= Muokkaa
$BTN_TEXT_STICKY			= Lukitse
$BTN_TEXT_BOOKMARK			= Kirjanmerkki
$BTN_TEXT_SLIDESHOW			= Diaesitys
$BTN_TEXT_UPDATE			= Uusi versio saatavilla

$TEXT_SETTINGTAB_GENERAL		= Yleinen
$TEXT_SETTINGTAB_VIEW			= Katsele
$TEXT_SETTINGTAB_BOOKMARK		= Kirjanmerkki
$TEXT_SETTINGTAB_ASSOC			= Tiedostokiinnitys
$TEXT_SETTINGTAB_IMAGEPROCESS		= Kuvankäsittely
$TEXT_SETTINGTAB_KEYBOARD		= Näppäimistö
$TEXT_SETTINGTAB_MOUSE			= Hiiri
$TEXT_SETTINGTAB_SHELL			= Kontekstivalikko
$TEXT_SETTINGTAB_ETC			= Sekalaiset
$TEXT_SETTINGTAB_LANG			= Kieli

$TEXT_DESKTOP				= Työpöytä
$TEXT_DOCUMENT				= Tiedosto
$TEXT_PICTURE				= Kuva
$TEXT_COMPUTER				= Tietokone


[SHELL]
TEXT_LAUNCH_TRANSFORM_DLG		= Muunna Honeyviewillä(&2)
TEXT_LAUNCH_HONEYVIEW			= Katsele Honeyviewillä(&3)
TEXT_LOADING				= Ladataan...
TEXT_IMAGE_LOAD_FAILED			= Tiedoston lataus epäonnistui
TEXT_IMAGE_LOAD_FAIL_NOT_SUPPORTED	= Esikatselua ei saatavilla


[INSTALLER]
LNK_FILE_DESC				= Suorita Honeyview
UNINSTALLER_LNK_NAME 			= Sovelluksen poisto

MSG_STILLRUN_EXIT_PROGRAM		= Honeyview on päällä. Sulje sovellus ensiksi.
MSG_ASK_DELETE_ALL_FILES		= Tiedostoja $INSTDIR ei ole poistettu. [br]Poista kaikki tiedostot?
MSG_ASK_RESTART_EXPLORER		= Päättääksesi asennuksen, Järjestelmä on käynnistettävä uudelleen. Haluatko tehdä sen nyt?
MSG_ASK_UNINSTALL_HV3			= Honeyview3 on jo asennettu. Sinun pitää poistaa asennettu Honeyview3 asentaaksesi uuden version. Haluatko jatkaa?
MSG_UNINSTALL_HV3_FAILED		= Poistaminen epäonnistui.
MSG_RESTART_EXPLORER			= Järjestelmä käynnistyy uudelleen, jotta Honeyview3:n asennus saatetaan loppuun.

TEXT_LICENSE				= Honeyview Lisenssisopimus
TEXT_OPTIONS				= Asennusasetus
TEXT_OPT_PROGRAMGROUP			= Luo ohjelmaryhmä
TEXT_OPT_DESKTOPSHORCUT			= Luo työpöydän pikakuvake
TEXT_OPT_QUICKLAUNCH			= Luo pikakuvake pikakäynnistykseen
TEXT_OPT_FOLDER				= Kohde kansio
TEXT_OPT_REGIMAGE			= Käytä sovellusta kuvatiedostojen avaamiseen
TEXT_SELECT_FOLDER			= Valitse kansio
TEXT_LICENSE_LINK			= [Website]

TEXT_INSTALLER_MAIN_LICENSE_LINE_1	= LOPPUKÄYTTÄJÄN LISENSSISOPIMUS
TEXT_INSTALLER_MAIN_LICENSE_LINE_2	= Honeyview on ilmainen supernopea kuvankatseluohjelma, jonka on kehittänyt Bandisoft ja jako myös kuuluu Bandisoftille.[br][br]Tämä sovellus on ilmainen yksityis-, yritys-, hallintokäytössä jne.

TEXT_ASK_RESTART_EXPLORER		= Järjestelmä käynnistyy uudelleen, jotta asennus valmistuu täydellisesti. Haluatko tehdä sen nyt?
TEXT_NEED_ADMIN_PRIVILEGE		= Tämän sovelluksen voi asentaa vain järjestelmävalvojan oikeuksilla.[br][br]Muiden kuin järjestelmävalvojan asentamana sovellus ei toimi oikein.[br][br]Haluatko lopettaa asennuksen?

